Revit 2027 API
FormattedText.SetSuperscriptStatus Method
Overload List
Name | Description
SetSuperscriptStatus(Boolean) |  Sets the characters in the entire text to be superscript or not superscript.
SetSuperscriptStatus(TextRange, Boolean) |  Sets the characters in a given text range to be superscript or not superscript.
Top
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace